In [3]:
import pandas as pd
import numpy as np

In [4]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [5]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

# 1

In [10]:
df.FlightNumber.fillna(value = {1:10055, 3:10075}, inplace = True )

In [18]:
df.FlightNumber = df.FlightNumber.astype(np.int32)

In [19]:
df.dtypes

From_To         object
FlightNumber     int32
RecentDelays    object
Airline         object
dtype: object

In [20]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

# 2

In [41]:
df_temp = pd.DataFrame()

In [43]:
df_temp['From_To'] = df.From_To.str.split('_')

In [44]:
df_temp['From'] = df_temp.From_To.apply(lambda x : x[0])
df_temp['To'] = df_temp.From_To.apply(lambda x : x[1])

In [45]:
df_temp

               From_To      From         To
0      [LoNDon, paris]    LoNDon      paris
1      [MAdrid, miLAN]    MAdrid      miLAN
2  [londON, StockhOlm]    londON  StockhOlm
3    [Budapest, PaRis]  Budapest      PaRis
4   [Brussels, londOn]  Brussels     londOn

# 3

In [46]:
df_temp.From = df_temp.From.str.capitalize()
df_temp.To = df_temp.To.str.capitalize()

In [47]:
df_temp

               From_To      From         To
0      [LoNDon, paris]    London      Paris
1      [MAdrid, miLAN]    Madrid      Milan
2  [londON, StockhOlm]    London  Stockholm
3    [Budapest, PaRis]  Budapest      Paris
4   [Brussels, londOn]  Brussels     London

# 4

In [49]:
df.drop(['From_To'], axis = 1, inplace = True)

In [51]:
df['From'] = df_temp['From']
df['To'] = df_temp['To']

In [52]:
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

# 5

In [67]:
def fn(x):
    try:
        return x[0]
    except:
        return np.nan

def fn2(x):
    try:
        return x[1]
    except:
        return np.nan
def fn3(x):
    try:
        return x[2]
    except:
        return np.nan

In [68]:
df['Delay_1'] = df.RecentDelays.apply(fn)
df['Delay_2'] = df.RecentDelays.apply(fn2)
df['Delay_3'] = df.RecentDelays.apply(fn3)

In [70]:
df.drop(['RecentDelays'], axis = 1, inplace = True)

In [71]:
df

,FlightNumber,Airline,From,To,Delay_1,Delay_2,Delay_3
0,10045,KLM(!),London,Paris,23.0,47.0,NaN
1,10055,<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065,(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,10075,12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085,"""Swiss Air""",Brussels,London,67.0,32.0,NaN